src/Catalogs/ШаблоныШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныШК</Name>
			<Comment>для идентификации штих-кодов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКодВес</Name>
					<Comment>в каком порядке находятся "код, вес" или "вес, код"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаКода</Name>
					<Comment>количество знаков отведенное для кода</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножительКоличества</Name>
					<Comment>Множитель количества</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыШаблоновШК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныШК/Ext/ManagerModule.bsl
// Получить код и количество из ШК
//
Процедура ПолучитьКодКоличествоИзШК(Префикс, ШК, Код = 0, Количество = 0, Товар = Неопределено, Каталог = Неопределено) Экспорт
	
	ТекШаблон = Справочники.ШаблоныШК.НайтиПоКоду(Префикс);
	
	Если ТекШаблон.Пустая() Тогда
		Код 		= 0;
		Количество	= 0;
		Возврат;
	КонецЕсли;
	
	ТелоШК = Сред(ШК, 3, 10);
	Попытка
		Код 		= ?(ТекШаблон.ПорядокКодВес, Число(Лев(ТелоШК, ТекШаблон.ДлинаКода)), Число(Прав(ТелоШК, ТекШаблон.ДлинаКода)));	
	Исключение
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Товар КАК Товар
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	НЕ ШтрихКоды.ПометкаУдаления
	|	И НЕ ШтрихКоды.Товар.ПометкаУдаления
	|	И ШтрихКоды.ШтрихКод = &ШтрихКод
	|	И (ШтрихКоды.Товар.Владелец = &Каталог
	|			ИЛИ &Каталог = НЕОПРЕДЕЛЕНО)");
	Запрос.УстановитьПараметр("ШтрихКод", Сред(ШК, 1, 7));
	Запрос.УстановитьПараметр("Каталог", Каталог);
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		Товар = Рез.Выгрузить()[0][0];
	КонецЕсли;
	
	Количество	= ?(ТекШаблон.ПорядокКодВес, Число(Прав(ТелоШК, 10 - ТекШаблон.ДлинаКода)), Число(Лев(ТелоШК, 10 - ТекШаблон.ДлинаКода))) * ТекШаблон.МножительКоличества;
	
КонецПроцедуры
